Import NumPy and pandas

Created the 'results' DataFrame and preview the first 5 rows.

In [1]:
import pandas as pd
import numpy as np

results = pd.read_csv('../data/results.csv')

results.head()

,date,home_team,away_team,home_score,away_score,competition,stadium,city,country,neutral,world_cup
0,1871-03-27,Scotland,England,1,0,1871 Scotland v England International,Raeburn Place,Edinburgh,Scotland,False,False
1,1872-02-05,England,Scotland,2,1,1871–72 Home Nations International,The Oval,London,England,False,False
2,1873-03-03,Scotland,England,0,0,1872–73 Home Nations International,West of Scotland F.C.,Glasgow,Scotland,False,False
3,1874-02-23,England,Scotland,1,0,1873–74 Home Nations International,The Oval,London,England,False,False
4,1875-02-15,England,Ireland,2,0,1874–75 Home Nations rugby union matches,The Oval,London,England,False,False

In [2]:
unique_stadiums = results['stadium'].value_counts()

unique_stadiums

stadium
Twickenham                                    234
Lansdowne Road                                229
Murrayfield Stadium                           176
Millennium Stadium                            134
National Stadium                              116
                                             ...
Estadio José Amalfitani                         1
Estadio Brigadier General Estanislao López      1
Royal Bafokeng Stadium                          1
Estadio Raúl Conti                              1
Optus Stadium                                   1
Name: count, Length: 237, dtype: int64

237 unique stadiums.

calculate score differentials:

In [3]:
results['score_difference'] = results['home_score'] - results['away_score']

results.sort_values(
    by = 'score_difference',
    ascending = False
).head()

,date,home_team,away_team,home_score,away_score,competition,stadium,city,country,neutral,world_cup,score_difference
1566,1999-06-19,South Africa,Italy,101,0,1999 Italy rugby union tour of South Africa,Kings Park Stadium,Durban,South Africa,False,False,101
1585,1999-10-14,New Zealand,Italy,101,3,1999 Rugby World Cup,McAlpine Stadium,Huddersfield,England,True,True,98
1480,1997-06-21,New Zealand,Argentina,93,8,1997 Argentina tour of New Zealand,Athletic Park,Wellington,New Zealand,False,False,85
1529,1998-06-27,South Africa,Wales,96,13,1998 Wales tour of Zimbabwe and South Africa,Loftus Versfeld,Pretoria,South Africa,False,False,83
2745,2023-09-29,New Zealand,Italy,96,17,2023 Rugby World Cup,Parc Olympique,Lyon,France,True,True,79

check dtypes attribute to see if date column is text/object

In [4]:
results.dtypes

date                object
home_team           object
away_team           object
home_score           int64
away_score           int64
competition         object
stadium             object
city                object
country             object
neutral               bool
world_cup             bool
score_difference     int64
dtype: object

In [5]:
def date_to_year(df):
    df['year'] = df['date'].str[:4]
    return df

results = date_to_year(results)

results.head()

,date,home_team,away_team,home_score,away_score,competition,stadium,city,country,neutral,world_cup,score_difference,year
0,1871-03-27,Scotland,England,1,0,1871 Scotland v England International,Raeburn Place,Edinburgh,Scotland,False,False,1,1871
1,1872-02-05,England,Scotland,2,1,1871–72 Home Nations International,The Oval,London,England,False,False,1,1872
2,1873-03-03,Scotland,England,0,0,1872–73 Home Nations International,West of Scotland F.C.,Glasgow,Scotland,False,False,0,1873
3,1874-02-23,England,Scotland,1,0,1873–74 Home Nations International,The Oval,London,England,False,False,1,1874
4,1875-02-15,England,Ireland,2,0,1874–75 Home Nations rugby union matches,The Oval,London,England,False,False,2,1875

In [6]:
results['total_points'] = results['home_score'] + results['away_score']

results.head()

,date,home_team,away_team,home_score,away_score,competition,stadium,city,country,neutral,world_cup,score_difference,year,total_points
0,1871-03-27,Scotland,England,1,0,1871 Scotland v England International,Raeburn Place,Edinburgh,Scotland,False,False,1,1871,1
1,1872-02-05,England,Scotland,2,1,1871–72 Home Nations International,The Oval,London,England,False,False,1,1872,3
2,1873-03-03,Scotland,England,0,0,1872–73 Home Nations International,West of Scotland F.C.,Glasgow,Scotland,False,False,0,1873,0
3,1874-02-23,England,Scotland,1,0,1873–74 Home Nations International,The Oval,London,England,False,False,1,1874,1
4,1875-02-15,England,Ireland,2,0,1874–75 Home Nations rugby union matches,The Oval,London,England,False,False,2,1875,2

In [7]:
results['year'] = results['year'].astype(int)

results.dtypes

date                object
home_team           object
away_team           object
home_score           int64
away_score           int64
competition         object
stadium             object
city                object
country             object
neutral               bool
world_cup             bool
score_difference     int64
year                 int64
total_points         int64
dtype: object

In [8]:
results = results[['year', 'home_team', 'away_team', 'home_score', 'away_score', 'score_difference', 'total_points']]
results.head()

,year,home_team,away_team,home_score,away_score,score_difference,total_points
0,1871,Scotland,England,1,0,1,1
1,1872,England,Scotland,2,1,1,3
2,1873,Scotland,England,0,0,0,0
3,1874,England,Scotland,1,0,1,1
4,1875,England,Ireland,2,0,2,2

In [9]:
# No points for a try
# Team could only win a match if they successfully kicked a goal, either from a try or a drop goal

era_one = results[results['year'] < 1890]
era_one.head()

,year,home_team,away_team,home_score,away_score,score_difference,total_points
0,1871,Scotland,England,1,0,1,1
1,1872,England,Scotland,2,1,1,3
2,1873,Scotland,England,0,0,0,0
3,1874,England,Scotland,1,0,1,1
4,1875,England,Ireland,2,0,2,2

In [10]:
# Introduction of points for tries
# A try was worth 1 point, a conversion 2 points, a penalty goal 3 points, and a drop goal 4 points

results_after_1890_mask = results['year'] > 1890
results_before_1905_mask = results['year'] < 1905

era_two = results_after_1890_mask & results_before_1905_mask

era_two = results[era_two]

era_two

,year,home_team,away_team,home_score,away_score,score_difference,total_points
65,1891,Wales,England,3,7,-4,10
66,1891,Scotland,Wales,15,0,15,15
67,1891,Ireland,England,0,9,-9,9
68,1891,Ireland,Scotland,0,14,-14,14
69,1891,Wales,Ireland,6,4,2,10
...,...,...,...,...,...,...,...
142,1904,Wales,Scotland,21,3,18,24
143,1904,England,Ireland,19,0,19,19
144,1904,Ireland,Scotland,3,19,-16,22
145,1904,Ireland,Wales,14,12,2,26
146,1904,Scotland,England,6,3,3,9

In [11]:
# 1905: A try increased to 3 points.

results_from_1905_mask = results['year'] >= 1905
results_before_1948_mask = results['year'] < 1948

era_three = results_from_1905_mask & results_before_1948_mask

era_three = results[era_three]

era_three

,year,home_team,away_team,home_score,away_score,score_difference,total_points
147,1905,Wales,England,25,0,25,25
148,1905,Scotland,Wales,3,6,-3,9
149,1905,Ireland,England,17,3,14,20
150,1905,Scotland,Ireland,5,11,-6,16
151,1905,Wales,Ireland,10,3,7,13
...,...,...,...,...,...,...,...
491,1947,Australia,New Zealand,5,13,-8,18
492,1947,Australia,New Zealand,14,27,-13,41
493,1947,Scotland,Australia,7,16,-9,23
494,1947,Ireland,Australia,3,16,-13,19
495,1947,Wales,Australia,6,0,6,6

In [12]:
# 1948: Drop goals were reduced from 4 points to 3 points, to ensure they didn’t outweigh tries

results_from_1948_mask = results['year'] >= 1948
results_before_1971_mask = results['year'] < 1971

era_four = results_from_1948_mask & results_before_1971_mask

era_four = results[era_four]

era_four

,year,home_team,away_team,home_score,away_score,score_difference,total_points
496,1948,France,Ireland,6,13,-7,19
497,1948,England,Australia,0,11,-11,11
498,1948,France,Australia,13,6,7,19
499,1948,England,Wales,3,3,0,6
500,1948,Wales,Scotland,14,0,14,14
...,...,...,...,...,...,...,...
880,1970,Australia,Scotland,23,3,20,26
881,1970,South Africa,New Zealand,17,6,11,23
882,1970,South Africa,New Zealand,8,9,-1,17
883,1970,South Africa,New Zealand,14,3,11,17
884,1970,South Africa,New Zealand,20,17,3,37

In [13]:
# 1971: A try increased to 4 points to reward attacking rugby.

results_from_1971_mask = results['year'] >= 1971
results_before_1992_mask = results['year'] < 1992

era_five = results_from_1971_mask & results_before_1992_mask

era_five = results[era_five]

era_five

,year,home_team,away_team,home_score,away_score,score_difference,total_points
885,1971,France,Scotland,13,8,5,21
886,1971,Wales,England,22,6,16,28
887,1971,Ireland,France,9,9,0,18
888,1971,Scotland,Wales,18,19,-1,37
889,1971,Ireland,England,6,9,-3,15
...,...,...,...,...,...,...,...
1304,1991,Ireland,Australia,18,19,-1,37
1305,1991,Scotland,England,6,9,-3,15
1306,1991,New Zealand,Australia,6,16,-10,22
1307,1991,New Zealand,Scotland,13,6,7,19
1308,1991,England,Australia,6,12,-6,18

In [14]:
# modern era: 1992: A try increased to 5 points to reward attacking rugby.
modern_era_mask = results['year'] >= 1992

modern_era = results[modern_era_mask]   

modern_era

,year,home_team,away_team,home_score,away_score,score_difference,total_points
1309,1992,Ireland,Wales,15,16,-1,31
1310,1992,Scotland,England,7,25,-18,32
1311,1992,Wales,France,9,12,-3,21
1312,1992,England,Ireland,38,9,29,47
1313,1992,France,England,13,31,-18,44
...,...,...,...,...,...,...,...
2778,2024,Argentina,France,33,25,8,58
2779,2024,Australia,South Africa,7,33,-26,40
2780,2024,New Zealand,Argentina,30,38,-8,68
2781,2024,New Zealand,Argentina,42,10,32,52
2782,2024,Australia,South Africa,12,30,-18,42

In [ ]:
era_one_means = era_one[['score_difference', 'total_points']].mean().round(decimals=2)

In [ ]:
era_two_means = era_two[['score_difference', 'total_points']].mean().round(decimals=2)

In [ ]:
era_three_means = era_three[['score_difference', 'total_points']].mean().round(decimals=2)

In [ ]:
era_four_means = era_four[['score_difference', 'total_points']].mean().round(decimals=2)

In [ ]:
era_five_means = era_five[['score_difference', 'total_points']].mean().round(decimals=2)

In [ ]:
# Modern era: Try = 5 points, Conversion = 2 points, #Penalty goal = 3 points, Drop goal = 3 points

modren_era_means = modern_era[['score_difference', 'total_points']].mean().round(decimals=2)

score_difference     3.98
total_points        45.80

In [22]:
# store these means for each era in a dataframe

era_means_tp_sd = pd.DataFrame(
    [era_one_means, era_two_means, era_three_means, era_four_means, era_five_means, modren_era_means],
    index = ['Era 1', 'Era 2', 'Era 3', 'Era 4', 'Era 5', 'Modern Era']
)

column_mapper = ['Mean Score Difference', 'Mean Total Points']

era_means_tp_sd.columns = column_mapper

era_means_tp_sd

            Mean Score Difference  Mean Total Points
Era 1                        0.41               1.69
Era 2                        2.23              12.52
Era 3                        1.00              19.12
Era 4                        1.86              17.90
Era 5                        3.94              31.95
Modern Era                   3.98              45.80